# Brazilian Company Identifiers

## Introduction

The function `clean_br_cnpj()` cleans a column containing Brazilian company identifier (CNPJ) strings, and standardizes them in a given format. The function `validate_br_cnpj()` validates either a single cnpj strings, a column of CNPJ strings or a DataFrame of CNPJ strings, returning `True` if the value is valid, and `False` otherwise.

CNPJ strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "16727230000197"
* `standard`: cnpj strings with proper whitespace in the proper places, like "16.727.230/0001-97"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_br_cnpj()` and `validate_br_cnpj()`.

### An example dataset containing cnpj strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "cnpj": [
            "16.727.230/0001-97",
            "16.727.230.0001-98",
            "16.727.230/0001=97",
            "16727230000197",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

                 cnpj                                           address
0  16.727.230/0001-97                                     123 Pine Ave.
1  16.727.230.0001-98                                           main st
2  16.727.230/0001=97                      1234 west main heights 57033
3      16727230000197                    apt 1 789 s maple rd manhattan
4               hello                robie house, 789 north main street
5                 NaN  (staples center) 1111 S Figueroa St, Los Angeles
6                NULL                                             hello

## 1. Default `clean_br_cnpj`

By default, `clean_br_cnpj` will clean cnpj strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_br_cnpj
clean_br_cnpj(df, column = "cnpj")

,cnpj,address,cnpj_clean
0,16.727.230/0001-97,123 Pine Ave.,16.727.230/0001-97
1,16.727.230.0001-98,main st,NaN
2,16.727.230/0001=97,1234 west main heights 57033,NaN
3,16727230000197,apt 1 789 s maple rd manhattan,16.727.230/0001-97
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_br_cnpj(df, column = "cnpj", output_format="standard")

,cnpj,address,cnpj_clean
0,16.727.230/0001-97,123 Pine Ave.,16.727.230/0001-97
1,16.727.230.0001-98,main st,NaN
2,16.727.230/0001=97,1234 west main heights 57033,NaN
3,16727230000197,apt 1 789 s maple rd manhattan,16.727.230/0001-97
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_br_cnpj(df, column = "cnpj", output_format="compact")

,cnpj,address,cnpj_clean
0,16.727.230/0001-97,123 Pine Ave.,16727230000197
1,16.727.230.0001-98,main st,NaN
2,16.727.230/0001=97,1234 west main heights 57033,NaN
3,16727230000197,apt 1 789 s maple rd manhattan,16727230000197
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned CNPJ strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_br_cnpj(df, column="cnpj", inplace=True)

           cnpj_clean                                           address
0  16.727.230/0001-97                                     123 Pine Ave.
1                 NaN                                           main st
2                 NaN                      1234 west main heights 57033
3  16.727.230/0001-97                    apt 1 789 s maple rd manhattan
4                 NaN                robie house, 789 north main street
5                 NaN  (staples center) 1111 S Figueroa St, Los Angeles
6                 NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_br_cnpj(df, "cnpj", errors="coerce")

,cnpj,address,cnpj_clean
0,16.727.230/0001-97,123 Pine Ave.,16.727.230/0001-97
1,16.727.230.0001-98,main st,NaN
2,16.727.230/0001=97,1234 west main heights 57033,NaN
3,16727230000197,apt 1 789 s maple rd manhattan,16.727.230/0001-97
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_br_cnpj(df, "cnpj", errors="ignore")

,cnpj,address,cnpj_clean
0,16.727.230/0001-97,123 Pine Ave.,16.727.230/0001-97
1,16.727.230.0001-98,main st,16.727.230.0001-98
2,16.727.230/0001=97,1234 west main heights 57033,16.727.230/0001=97
3,16727230000197,apt 1 789 s maple rd manhattan,16.727.230/0001-97
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_br_cnpj()`

`validate_br_cnpj()` returns `True` when the input is a valid CNPJ. Otherwise it returns `False`.

The input of `validate_br_cnpj()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_br_cnpj()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_br_cnpj()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_br_cnpj
print(validate_br_cnpj('16.727.230/0001-97'))
print(validate_br_cnpj('16.727.230.0001-98'))
print(validate_br_cnpj('16.727.230/0001=97'))
print(validate_br_cnpj("51 824 753 556"))
print(validate_br_cnpj("hello"))
print(validate_br_cnpj(np.nan))
print(validate_br_cnpj("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_br_cnpj(df["cnpj"])

0     True
1    False
2    False
3     True
4    False
5    False
6    False
Name: cnpj, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_br_cnpj(df, column="cnpj")

0     True
1    False
2    False
3     True
4    False
5    False
6    False
Name: cnpj, dtype: bool

### Only DataFrame

In [11]:
validate_br_cnpj(df)

    cnpj  address
0   True    False
1  False    False
2  False    False
3   True    False
4  False    False
5  False    False
6  False    False